---
kind: enumMember
id: F:Autodesk.Revit.DB.Analysis.SpatialFieldPrimitiveHideMode.HideNone
enum: Autodesk.Revit.DB.Analysis.SpatialFieldPrimitiveHideMode
source: html/946277c7-6e1a-7f6a-7bd3-7693904e74fd.htm
---
# Autodesk.Revit.DB.Analysis.SpatialFieldPrimitiveHideMode.HideNone

Do not hide any piece of the original model element.